from typing import re

countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                  "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                  "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага",
                  "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                  "Северная Македония": "Скопье", "Сербия": "Белград"}
print(countries_dict)
a = input("Введите название страны, чтобы узнать ее столицу:  ")
if a in countries_dict:
    print("столица страны", a, " - ", countries_dict[a])
else:
    print("в списке нет такой страны")
for key in sorted(countries_dict):
    print(key, "-", countries_dict[key])


def n2():
    alph = {"авеинорст": 1,
            "дклмпу": 2,
            "бгёья": 3,
            "йы": 4,
            "жзхцч": 5,
            "шэю": 8,
            "фщъ": 10
            }

    b = input("Введите слово, а я скажу сколько баллов вы набрали!  ")
    c = 0
    for i in b:
        for x in alph:
            if i in x:
                c += alph[x.lower()]
    print("Сумма", c)

n2()

def n3():
    students = {"балабанов сергей": "английский, русский",
                "кудряшева полина": "китайский, английский, русский", "маковская лиза": "русский",
                "старикова руслана": "немецкий, китайский",
                "боброва татьяна": "китайский, английский", "ефимова полина": "английский",
                "черемухина ольга": "французский",
                "тиняков алексей": "китайский", "наумова елена": "английский"}
    language = []
    name = []
    for key in sorted(students):
        print(key, "-", students[key])

    for i in students:
        c = students[i.lower()].split(", ")
        for x in c:
            language.append(x)
            if x == "китайский":
                name.append(i)
    lang = sorted(set(language))
    print("список языков:", language)
    print("Студенты, которые знают китайский:", name)


n3()
